<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Objectives" data-toc-modified-id="Objectives-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Objectives</a></span></li><li><span><a href="#Aggregating-Functions" data-toc-modified-id="Aggregating-Functions-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Aggregating Functions</a></span><ul class="toc-item"><li><span><a href="#Example-Simple-Aggregations" data-toc-modified-id="Example-Simple-Aggregations-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Example Simple Aggregations</a></span></li></ul></li><li><span><a href="#Grouping-in-SQL" data-toc-modified-id="Grouping-in-SQL-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Grouping in SQL</a></span><ul class="toc-item"><li><span><a href="#Example-GROUP-BY--Statements" data-toc-modified-id="Example-GROUP-BY--Statements-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Example <code>GROUP BY</code>  Statements</a></span><ul class="toc-item"><li><span><a href="#Without-GROUP-BY" data-toc-modified-id="Without-GROUP-BY-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Without <code>GROUP BY</code></a></span></li><li><span><a href="#With-GROUP-BY" data-toc-modified-id="With-GROUP-BY-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>With <code>GROUP BY</code></a></span></li></ul></li><li><span><a href="#Group-Task" data-toc-modified-id="Group-Task-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Group Task</a></span><ul class="toc-item"><li><span><a href="#Possible-Solution" data-toc-modified-id="Possible-Solution-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Possible Solution</a></span></li></ul></li><li><span><a href="#Exercise:-Grouping" data-toc-modified-id="Exercise:-Grouping-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Exercise: Grouping</a></span><ul class="toc-item"><li><span><a href="#Possible-Solution" data-toc-modified-id="Possible-Solution-3.3.1"><span class="toc-item-num">3.3.1&nbsp;&nbsp;</span>Possible Solution</a></span></li></ul></li></ul></li><li><span><a href="#Filtering-Groups-with-HAVING" data-toc-modified-id="Filtering-Groups-with-HAVING-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Filtering Groups with <code>HAVING</code></a></span><ul class="toc-item"><li><span><a href="#Examples-of-Using-HAVING" data-toc-modified-id="Examples-of-Using-HAVING-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Examples of Using <code>HAVING</code></a></span><ul class="toc-item"><li><span><a href="#Simple-Filtering---Number-of-Airports-in-a-Country" data-toc-modified-id="Simple-Filtering---Number-of-Airports-in-a-Country-4.1.1"><span class="toc-item-num">4.1.1&nbsp;&nbsp;</span>Simple Filtering - Number of Airports in a Country</a></span></li></ul></li><li><span><a href="#Filtering-Different-Aggregation---Airport-Altitudes" data-toc-modified-id="Filtering-Different-Aggregation---Airport-Altitudes-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Filtering Different Aggregation - Airport Altitudes</a></span><ul class="toc-item"><li><span><a href="#Looking-at-the-airports-Table" data-toc-modified-id="Looking-at-the-airports-Table-4.2.1"><span class="toc-item-num">4.2.1&nbsp;&nbsp;</span>Looking at the <code>airports</code> Table</a></span></li><li><span><a href="#Looking-at-the-Highest-Airport" data-toc-modified-id="Looking-at-the-Highest-Airport-4.2.2"><span class="toc-item-num">4.2.2&nbsp;&nbsp;</span>Looking at the Highest Airport</a></span></li><li><span><a href="#Looking-at-the-Number-of-Airports-Too" data-toc-modified-id="Looking-at-the-Number-of-Airports-Too-4.2.3"><span class="toc-item-num">4.2.3&nbsp;&nbsp;</span>Looking at the Number of Airports Too</a></span></li><li><span><a href="#Finally-Filter-Aggregation" data-toc-modified-id="Finally-Filter-Aggregation-4.2.4"><span class="toc-item-num">4.2.4&nbsp;&nbsp;</span>Finally Filter Aggregation</a></span></li></ul></li></ul></li></div>

![sql](img/sql-logo.jpg)

In [2]:
# Import data cleaning/processing library
import pandas as pd

# Import file-based database library 
import sqlite3

# open connection to the flights database.
conn = sqlite3.connect("flights.db")

# create cursor object which will allow us to interact with the flights database.
cur = conn.cursor()

<span style="color:red"> <font size="4"> **STUDENT QUESTION**: what is the cursor object for?</font></span>

The cursor object is used more in base-python way of interacting with db's via sqlite. If we're not using pandas and were instead using base python, this would be the way to handle the data from queries. If you think back to the 'data analysis in base python' lectures where we went in and did analysis without pandas and it was more complex using base python because we had to access data and build the data set using for loops that went into a JSON, for example, The same applies here. Thank goodness we have pandas and all its functionality to streamline this!!! In any case, its still worth knowing about the existence of this method of working with sqlite/sql.

In [62]:
#example of how to use cursor to execute queries and deal with the data

cur.execute('''SELECT *
FROM airports''')

# once you run the .execute() for the query, the cursor object has 
# this operation stored within it at some memory location in computers memory
# if we want to access the data we use .fetchall() on the cursor (which already
# has the query stored within it.)

cur.fetchall()[0:3]  #only print 3 rows-> this is alot of data to print out
                     # without slicing it. 


# this prints all the data 'row-by-row' as a list of tuples. each tuple is a row
# of data in this dataset. Can you imagine if we had to analyze our data 
# this way? there would be a fair amount of for loops to create here...

[(0,
  '1',
  'Goroka',
  'Goroka',
  'Papua New Guinea',
  'GKA',
  'AYGA',
  '-6.081689',
  '145.391881',
  '5282',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (1,
  '2',
  'Madang',
  'Madang',
  'Papua New Guinea',
  'MAG',
  'AYMD',
  '-5.207083',
  '145.7887',
  '20',
  '10',
  'U',
  'Pacific/Port_Moresby'),
 (2,
  '3',
  'Mount Hagen',
  'Mount Hagen',
  'Papua New Guinea',
  'HGU',
  'AYMH',
  '-5.826789',
  '144.295861',
  '5388',
  '10',
  'U',
  'Pacific/Port_Moresby')]

# Objectives

- Use SQL aggregation functions with GROUP BY
- Use HAVING for group filtering

# Recap
lets reacquaint ourselves with our db using steps from last lecture:

### Explore the schema of our database -> 

**database schema**: a master listing of all database objects in the database and the SQL used to create each object.

**tables**: data that is logically organized in a row-and-column format similar to a spreadsheet. Each row represents a unique record, and each column represents a field in the record.

**index**: special lookup tables that the database search engine can use to speed up data retrieval.

In [3]:
# the read_sql function creates a dataframe from the sql query you give it. 
schema_df = pd.read_sql("""

SELECT *
FROM sqlite_master

""", conn)

schema_df

,type,name,tbl_name,rootpage,sql
0,table,airports,airports,2,"CREATE TABLE airports (\n[index] INTEGER,\n [..."
1,index,ix_airports_index,airports,3,CREATE INDEX ix_airports_index ON airports ([i...
2,table,airlines,airlines,945,"CREATE TABLE airlines (\n[index] INTEGER,\n [..."
3,index,ix_airlines_index,airlines,946,CREATE INDEX ix_airlines_index ON airlines ([i...
4,table,routes,routes,1393,"CREATE TABLE routes (\n[index] INTEGER,\n [ai..."
5,index,ix_routes_index,routes,1394,CREATE INDEX ix_routes_index ON routes ([index])

In [4]:
schema_df.iloc[0]

type                                                    table
name                                                 airports
tbl_name                                             airports
rootpage                                                    2
sql         CREATE TABLE airports (\n[index] INTEGER,\n  [...
Name: 0, dtype: object

In [7]:
airports_desc = schema_df.iloc[0]['sql']
print(airports_desc)

CREATE TABLE airports (
[index] INTEGER,
  [id] TEXT,
  [name] TEXT,
  [city] TEXT,
  [country] TEXT,
  [code] TEXT,
  [icao] TEXT,
  [latitude] TEXT,
  [longitude] TEXT,
  [altitude] TEXT,
  [offset] TEXT,
  [dst] TEXT,
  [timezone] TEXT
)

In [8]:
# We can also do get the same information by reading a SQL query for the airports table 
# into a pandas dataframe and inspect using .info()

pd.read_sql('''
    SELECT *
    FROM airports
''',conn).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8107 entries, 0 to 8106
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      8107 non-null   int64
 1   id         8107 non-null   object
 2   name       8107 non-null   object
 3   city       8107 non-null   object
 4   country    8107 non-null   object
 5   code       5880 non-null   object
 6   icao       8043 non-null   object
 7   latitude   8107 non-null   object
 8   longitude  8107 non-null   object
 9   altitude   8107 non-null   object
 10  offset     8107 non-null   object
 11  dst        8107 non-null   object
 12  timezone   8107 non-null   object
dtypes: int64(1), object(12)
memory usage: 823.5+ KB

In [17]:
pd.read_sql('''
    SELECT *
    FROM airports
''',conn).head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

# Aggregating Functions

>  A SQL **aggregating function** takes in many values and returns one value.

We have already seen some SQL aggregating functions like `COUNT()`. There are also others, like SUM(), AVG(), MIN(), and MAX().

## Example Simple Aggregations

In [16]:
# Max value for longitude (comments in sql are indicated with a '--')
pd.read_sql('''
    SELECT 
        -- Note we have to cast to a numerical value first
        MAX(
            -- REAL its a float-type value with less precision or decimal places
            CAST(longitude AS REAL)
        ) AS "max_longitude"
    FROM 
        airports
''', conn)

   max_longitude
0        179.951

In [19]:
# Max value for id in table
pd.read_sql('''
SELECT 
    MAX(CAST(id AS integer)) AS "max_id"
FROM 
    airports
''', conn)

   max_id
0    9541

In [21]:
pd.read_sql('''
SELECT *-- column names go after SELECT statement
FROM airlines
''',conn).head()

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

In [22]:
# Effectively counts all the inactive airlines 
pd.read_sql('''
    SELECT 
        COUNT() AS "num_airlines_inactive"
    FROM 
        airlines
    WHERE 
        active='N'
''', conn)

   num_airlines_inactive
0                   4886

We can also give aliases to our aggregations:

In [23]:
# Effectively counts all the active airlines 
pd.read_sql('''
    SELECT 
        COUNT() AS number_of_active_airlines
    FROM 
        airlines
    WHERE 
        active='Y'
''', conn)

   number_of_active_airlines
0                       1161

# Grouping in SQL

We can go deeper and use aggregation functions on _groups_ using the `GROUP BY` clause.

The `GROUP BY` clause will group one or more columns together with the same values as one group to perform aggregation functions on much like the `.groupby()` operation/method in pandas.

## Example `GROUP BY`  Statements

Let's say we want to know how many active and non-active airlines there are.

### Without `GROUP BY`

Let's first start with just seeing how many airlines there are:

In [24]:
df_results = pd.read_sql('''
    SELECT 
        
        -- Reminder that this counts the number of rows of both active/inactive airlines
        COUNT() AS number_of_airlines
    FROM 
        airlines
''', conn)

df_results

   number_of_airlines
0                6048

One way for us to get the counts for each is to create two queries that will filter each kind of airline (active vs non-active) and count those values:

In [25]:
df_active = pd.read_sql('''
    SELECT 
        COUNT() AS number_of_active_airlines
    FROM 
        airlines
    WHERE 
        active='Y'
''', conn)

df_not_active = pd.read_sql('''
    SELECT 
        COUNT() AS number_of_inactive_airlines
    FROM 
        airlines
    WHERE 
        active='N'
''', conn)

display(df_active)
display(df_not_active)

   number_of_active_airlines
0                       1161

   number_of_inactive_airlines
0                         4886

This works but it's inefficient.

### With `GROUP BY`

Instead, we can tell the SQL server to do the work for us by grouping values we care about for us!

In [27]:
pd.read_sql('''
SELECT active
FROM airlines''',conn).value_counts()

active
N         4886
Y         1161
n            1
dtype: int64

In [26]:
df_results = pd.read_sql('''
    SELECT 
        COUNT() AS number_of_airlines
    FROM 
        airlines
    GROUP BY
        active
''', conn)

df_results

   number_of_airlines
0                4886
1                1161
2                   1

This is great! And if you look closely, you can observe we have _three_ different groups instead of our expected two!

Because active was not referenced in our select statement, the query will return the information we want without
reference to the categories we're interested in. 

Let's also print out the `airlines.active` value for each group/aggregation so we know what we're looking at:

In [28]:
df_results = pd.read_sql('''
    SELECT 
        -- in pandas aswell if you want to access a column 
        -- you can do df['column_name'] but also df.column_name
        
        airlines.active,
        COUNT() AS number_of_airlines
    FROM 
        airlines
    GROUP BY
        airlines.active
''', conn)

df_results

  active  number_of_airlines
0      N                4886
1      Y                1161
2      n                   1

## Group Task

- Which countries have the highest numbers of active airlines? Return the top 10.

In [ ]:
pd.read_sql('''
    SELECT
        *
    FROM
        airlines
''', conn).head()

In [38]:
pd.read_sql('''

-- step 1.) select for columns you want / use agg_func
SELECT airlines.country, COUNT() AS "num_active_airlines"
FROM airlines

-- Step 2.) inspect for category we want -> "Y" in active
WHERE active="Y"

-- of the active airlines group by country, then count
GROUP BY country

-- Set display/organization operations (order/alphabetization (for text data))
ORDER BY num_active_airlines DESC


-- See first ten entries of query
LIMIT 10
''',conn)

          country  num_active_airlines
0   United States                  141
1          Russia                   72
2  United Kingdom                   40
3         Germany                   37
4          Canada                   34
5       Australia                   26
6           China                   25
7           Spain                   24
8          Brazil                   23
9          France                   22

<details>
    <summary><b>Possible Solution</b></summary>

``` sql
    pd.read_sql('''
    SELECT 
        COUNT() AS num,
        country
    FROM 
        airlines
    WHERE 
        active='Y'
    GROUP BY 
        country
    ORDER BY 
        num DESC
    LIMIT 10
    ''', conn)```
</details>

> Note that the `GROUP BY` clause is considered _before_ the `ORDER BY` and `LIMIT` clauses

## Exercise: Grouping

- Run a query that will return the number of airports by time zone. Each row should have a number of airports and a time zone.

In [39]:
# Your code here
pd.read_sql('''
SELECT *
FROM airports
''', conn).head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

In [42]:
pd.read_sql('''
SELECT timezone, COUNT() AS number_airports
FROM airports 
GROUP BY (timezone)
ORDER BY number_airports DESC

''',conn)

              timezone  number_airports
0     America/New_York              628
1      America/Chicago              373
2        Europe/Berlin              319
3    America/Anchorage              258
4         Europe/Paris              232
..                 ...              ...
289   America/Anguilla                1
290  Africa/Porto-Novo                1
291     Africa/Mbabane                1
292   Africa/Bujumbura                1
293      Africa/Banjul                1

[294 rows x 2 columns]

In [43]:
pd.read_sql('''
    SELECT 
        airports.timezone
        ,COUNT() AS num_of_airports
    FROM 
        airports
    GROUP BY
        airports.timezone
    ORDER BY
        num_of_airports DESC
''', conn)

              timezone  num_of_airports
0     America/New_York              628
1      America/Chicago              373
2        Europe/Berlin              319
3    America/Anchorage              258
4         Europe/Paris              232
..                 ...              ...
289   America/Anguilla                1
290  Africa/Porto-Novo                1
291     Africa/Mbabane                1
292   Africa/Bujumbura                1
293      Africa/Banjul                1

[294 rows x 2 columns]

<details>
    <summary><b>Possible Solution</b></summary>

``` sql
pd.read_sql('''
    SELECT 
        airports.timezone
        ,COUNT() AS num_of_airports
    FROM 
        airports
    GROUP BY
        airports.timezone
    ORDER BY
        num_of_airports DESC
''', conn) ```
</details>

# Filtering Groups with `HAVING`

We showed that you can filter tables with `WHERE`. We can similarly filter _groups/aggregations_ using `HAVING` clauses.

## Examples of Using `HAVING`

### Simple Filtering - Number of Airports in a Country

Let's come back to the aggregation of active airports:

In [44]:
pd.read_sql('''
    SELECT 
        COUNT() AS num,
        country
    FROM 
        airlines
    WHERE 
        active='Y'
    GROUP BY 
        country
    ORDER BY 
        num DESC
''', conn)

     num              country
0    141        United States
1     72               Russia
2     40       United Kingdom
3     37              Germany
4     34               Canada
..   ...                  ...
190    1  Antigua and Barbuda
191    1       American Samoa
192    1              AVIANCA
193    1               ALASKA
194    1                 S.A.

[195 rows x 2 columns]

We can see we have a lot of results. But maybe we only want to keep the countries that have more than $30$ active airlines:

In [45]:
pd.read_sql('''
    SELECT 
        country,
        COUNT() AS num
    FROM 
        airlines
    WHERE 
        active='Y'
    GROUP BY 
        country
    HAVING
        num > 30
    ORDER BY 
        num DESC
''', conn)

          country  num
0   United States  141
1          Russia   72
2  United Kingdom   40
3         Germany   37
4          Canada   34

## Filtering Different Aggregations - Airport Altitudes

We can also filter on other aggregations. For example, let's say we want to investigate the `airports` table.

Specifically, we want to know the height of the _highest airport_ in a country given that it has _at least $100$ airports_.

### Looking at the `airports` Table

In [46]:
df_airports = pd.read_sql('''
    SELECT 
        *
    FROM 
        airports 
''', conn)

df_airports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8107 entries, 0 to 8106
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      8107 non-null   int64
 1   id         8107 non-null   object
 2   name       8107 non-null   object
 3   city       8107 non-null   object
 4   country    8107 non-null   object
 5   code       5880 non-null   object
 6   icao       8043 non-null   object
 7   latitude   8107 non-null   object
 8   longitude  8107 non-null   object
 9   altitude   8107 non-null   object
 10  offset     8107 non-null   object
 11  dst        8107 non-null   object
 12  timezone   8107 non-null   object
dtypes: int64(1), object(12)
memory usage: 823.5+ KB

In [47]:
df_airports.head()

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby

### Looking at the Highest Airport

Let's first get the highest altitude for each airport:

In [48]:
pd.read_sql('''
    SELECT 
        airports.country
        ,MAX(
            CAST(airports.altitude AS REAL)   -- REAL gives less decimal points than float. 
        ) AS highest_airport_in_country
    FROM 
        airports 
    GROUP BY
        airports.country
    ORDER BY
        airports.country   -- ORDER BY for string alphabetizes.
''', conn)

            country  highest_airport_in_country
0       Afghanistan                      7400.0
1           Albania                       126.0
2           Algeria                      4518.0
3    American Samoa                       110.0
4            Angola                      5778.0
..              ...                         ...
235       West Bank                      2485.0
236  Western Sahara                       350.0
237           Yemen                      7216.0
238          Zambia                      4636.0
239        Zimbabwe                      4887.0

[240 rows x 2 columns]

### Looking at the Number of Airports Too

We can also get the number of airports for each country.

In [52]:
pd.read_sql('''
SELECT name
FROM airports
Group BY country
''',conn)

                 name
0               Herat
1        Tirana Rinas
2               Blida
3      Pago Pago Intl
4        Mbanza Congo
..                ...
235         Jerusalem
236  Hassan I Airport
237             Riyan
238           Kasompe
239    J M Nkomo Intl

[240 rows x 1 columns]

In [53]:
pd.read_sql('''
SELECT *
FROM airports''',conn)

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby
1,1,2,Madang,Madang,Papua New Guinea,MAG,AYMD,-5.207083,145.7887,20,10,U,Pacific/Port_Moresby
2,2,3,Mount Hagen,Mount Hagen,Papua New Guinea,HGU,AYMH,-5.826789,144.295861,5388,10,U,Pacific/Port_Moresby
3,3,4,Nadzab,Nadzab,Papua New Guinea,LAE,AYNZ,-6.569828,146.726242,239,10,U,Pacific/Port_Moresby
4,4,5,Port Moresby Jacksons Intl,Port Moresby,Papua New Guinea,POM,AYPY,-9.443383,147.22005,146,10,U,Pacific/Port_Moresby
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8102,8102,9537,Mansons Landing Water Aerodrome,Mansons Landing,Canada,YMU,\N,50.066667,-124.983333,0,-8,A,America/Vancouver
8103,8103,9538,Port McNeill Airport,Port McNeill,Canada,YMP,\N,50.575556,-127.028611,225,-8,A,America/Vancouver
8104,8104,9539,Sullivan Bay Water Aerodrome,Sullivan Bay,Canada,YTG,\N,50.883333,-126.833333,0,-8,A,America/Vancouver
8105,8105,9540,Deer Harbor Seaplane,Deer Harbor,United States,DHB,\N,48.618397,-123.00596,0,-8,A,America/Los_Angeles
8106,8106,9541,San Diego Old Town Transit Center,San Diego,United States,OLT,\N,32.7552,-117.1995,0,-8,A,America/Los_Angeles

In [49]:
pd.read_sql('''
    SELECT 
        airports.country
        ,MAX(
            CAST(airports.altitude AS REAL)
        ) AS highest_airport_in_country
        ,COUNT() AS number_of_airports_in_country
    FROM
        airports 
    GROUP BY
        airports.country
    ORDER BY
        airports.country
''', conn)

            country  highest_airport_in_country  number_of_airports_in_country
0       Afghanistan                      7400.0                             21
1           Albania                       126.0                              1
2           Algeria                      4518.0                             44
3    American Samoa                       110.0                              3
4            Angola                      5778.0                             26
..              ...                         ...                            ...
235       West Bank                      2485.0                              1
236  Western Sahara                       350.0                              3
237           Yemen                      7216.0                             11
238          Zambia                      4636.0                             13
239        Zimbabwe                      4887.0                             16

[240 rows x 3 columns]

### Filtering on Aggregations

> Recall:
>
> We want to know the height of the _highest airport_ in a country given that it has _at least $100$ airports_.

In [56]:
pd.read_sql('''
    SELECT 
        airports.country
        ,MAX(
            CAST(airports.altitude AS REAL)
        ) AS highest_airport_in_country
        -- Note we don't have to include this in our SELECT
        ,COUNT() AS number_of_airports_in_country
    FROM
        airports 
    GROUP BY
        airports.country
    HAVING
        number_of_airports_in_country >= 100
    ORDER BY
        number_of_airports_in_country DESC
''', conn)

           country  highest_airport_in_country  number_of_airports_in_country
0    United States                      9308.0                           1697
1           Canada                      3939.0                            435
2          Germany                      2297.0                            321
3        Australia                      4260.0                            263
4           Russia                     13411.0                            249
5           France                      6588.0                            233
6            China                     14472.0                            219
7           Brazil                      8708.0                            213
8   United Kingdom                       811.0                            210
9            India                     10682.0                            140
10           Japan                      2200.0                            131
11       Indonesia                      9104.0                            114
12    South Africa                      5700.0                            103
13       Argentina                     11414.0                            103